/*=============================================================================

		背景[ bg.h ]

-------------------------------------------------------------------------------
	■　製作者
		大野拓也

	■　作成日
		2016/07/28
-------------------------------------------------------------------------------
	■　Update
		2016/07/28
			・定数定義追加
				#define BG_TEX_SPEED ( 0.005f )	//	どれくらいの速さでテクスチャ座標が変わるのか
			・プロトタイプ宣言追加
				void InitBg( void );	//	背景の初期化
				void UninitBg( void );	//	背景の終了
				void UpdateBg( void );	//	背景の更新
				void DrawBg( void );	//	背景の描画
				float *GetBgTex(void);	//	背景のテクスチャ座標取得
-----------------------------------------------------------------------------*/

#ifndef _BG_H_
#define _BG_H_
/*-----------------------------------------------------------------------------
	定数定義
-----------------------------------------------------------------------------*/
#define BG_TEX_SPEED ( 0.001f )	//	どれくらいの速さでテクスチャ座標が変わるのか
/*-----------------------------------------------------------------------------
	プロトタイプ宣言
-----------------------------------------------------------------------------*/
void InitBg( void );	//	背景の初期化
void UninitBg( void );	//	背景の終了
void UpdateBg( void );	//	背景の更新
void DrawBg( void );	//	背景の描画
float *GetBgTex(void);	//	背景のテクスチャ座標取得
float *GetVTex( void );
#endif