/*=============================================================================

		雲[ cloud.h ]

-------------------------------------------------------------------------------
	■　製作者
		大野拓也

	■　作成日
		2016/09/14
			・定数定義追加
				#define MAX_CLOUD	//	雲の最大数
			・構造体追加
				typedef struct
				{
					D3DXVECTOR2 pos;	//	座標
					D3DXVECTOR2 size;	//	大きさ
					float move_X;	//	移動量
					bool use;
				}CLOUD;
			・プロトタイプ宣言追加
				void InitCloud(void);	//	雲の初期化
				void UninitCloud(void);	//	雲の終了
				void UpdateCloud(void);	//	雲の更新
				void DrawCloud(void);	//	雲の描画
				CLOUD *GetCloud( void );	//	雲情報の取得
		2016/09/27
			・定数定義削除
				#define MAX_CLOUD	//	雲の最大数
-------------------------------------------------------------------------------
	■　Update
		2016/09/14
-----------------------------------------------------------------------------*/
#ifndef _CLOUD_H_
#define _CLOUD_H_
/*-----------------------------------------------------------------------------
	構造体
-----------------------------------------------------------------------------*/
typedef struct
{
	D3DXVECTOR2 pos;	//	座標
	D3DXVECTOR2 size;	//	大きさ
	float move_X;	//	移動量
	bool use;
}CLOUD;
/*-----------------------------------------------------------------------------
	プロトタイプ宣言
-----------------------------------------------------------------------------*/
void InitCloud(void);	//	雲の初期化
void UninitCloud(void);	//	雲の終了
void UpdateCloud(void);	//	雲の更新
void DrawCloud(void);	//	雲の描画
CLOUD *GetCloud( void );	//	雲情報の取得
#endif