/*-----------------------------------------------------------------------------
	定数定義
-----------------------------------------------------------------------------*/
#define MAX_ENEMY ( 17 )	//	最大敵数
/*-----------------------------------------------------------------------------
	構造体
-----------------------------------------------------------------------------*/
typedef struct
{
	D3DXVECTOR2 Pos;	//	座標
	D3DXVECTOR2 OldPos;	//	前回の座標
	D3DXVECTOR2 Size;	//	大きさ
	D3DXVECTOR2 Move;	//	移動量
	float Scroll_Move_X;	//	スクロール時の移動量
	int Score;			//	スコア
	bool Use;		//	使用中ならtrue
}ENEMY;
/*-----------------------------------------------------------------------------
	プロトタイプ宣言
-----------------------------------------------------------------------------*/
void InitEnemy(void);	//	敵の初期化
void UninitEnemy(void);	//	敵の終了
void UpdateEnemy(void);	//	敵の更新
void DrawEnemy(void);	//	敵の描画
ENEMY *GetEnemy( int IndexEnemy );	//	敵情報の取得