/*=============================================================================

		プレイヤー[ player.h ]

-------------------------------------------------------------------------------
	■　製作者
		大野拓也

	■　作成日
		2016/07/28
-------------------------------------------------------------------------------
	■　Update
		2016/07/28
			・構造体追加
				PLAYER
			・プロトタイプ宣言追加
				void InitPlayer(void);	//	プレイヤーの初期化
				void UninitPlayer(void);	//	プレイヤーの終了
				void UpdatePlayer(void);	//	プレイヤーの更新
				void DrawPlayer(void);	//	プレイヤーの描画
				PLAYER *GetPlayer(void);	//	プレイヤー情報の取得
		2016/08/29
			・プロトタイプ宣言追加
				bool *GetGoolFlag( void );	//	ゴールしたかどうかの情報取得
-----------------------------------------------------------------------------*/
#ifndef _PLAYER_H_
#define _PLAYER_H_
/*-----------------------------------------------------------------------------
	定数定義
-----------------------------------------------------------------------------*/
#define GRAVITY ( 1.0f )	//	重力
#define TEX_WIDTH ( 0.5f )	//	一つのテクスチャの横幅
#define TEX_HEIGHT ( 0.5f )	//	一つのテクスチャの縦幅
/*-----------------------------------------------------------------------------
	構造体
-----------------------------------------------------------------------------*/
typedef struct
{
	D3DXVECTOR2 Pos;	//	座標
	D3DXVECTOR2 OldPos;	//	前回の座標
	D3DXVECTOR2 Size;	//	大きさ
	D3DXVECTOR2 Move;	//	移動量
	float Direct;	//	向き
	float HitMove_Y;	//	ヒットした時の移動量Y
	bool gool;	//	ゴールしたか
	bool Hit;	//	敵に当たったか
	bool Jump;	//	ジャンプしたか
	bool fall;	//	地面より下に行ったか
	bool bUse;	//	使用中ならtrue
}PLAYER;
/*-----------------------------------------------------------------------------
	プロトタイプ宣言
-----------------------------------------------------------------------------*/
void InitPlayer(void);	//	プレイヤーの初期化
void UninitPlayer(void);	//	プレイヤーの終了
void UpdatePlayer(void);	//	プレイヤーの更新
void DrawPlayer(void);	//	プレイヤーの描画
PLAYER *GetPlayer(void);	//	プレイヤー情報の取得
#endif