#ifndef _RANKING_H_
#define _RANKING_H_
/*-----------------------------------------------------------------------------
	構造体
-----------------------------------------------------------------------------*/
typedef struct
{
	//char name[ 3 ];
	unsigned int score;
}RANKING;
/*-----------------------------------------------------------------------------
	プロトタイプ宣言
-----------------------------------------------------------------------------*/
void InitRanking( void );	//	ランキングの初期化
void UninitRanking( void );	//	ランキングの終了
void UpdateRanking( void );	//	ランキングの更新
void DrawRanking( void );	//	ランキングの描画
#endif