/*=============================================================================

		スコア[ score.h ]

-------------------------------------------------------------------------------
	■　製作者
		大野拓也

	■　作成日
		2016/08/02
-------------------------------------------------------------------------------
	■　Update
		2016/08/02
			・プロトタイプ宣言追加
				void InitScore( void );	//	スコアの初期化
				void UninitScore( void );	//	スコアの終了
				void UpdateScore( void );	//	スコアの更新
				void DrawScore( void );	//	スコアの描画
				int *GetScore(void);	//	スコアの情報
		2016/09/15
			・定数定義追加
				#define SCORE_DIGIT	//	何桁の数字の表示
-----------------------------------------------------------------------------*/
#ifndef _SCORE_H_
#define _SCORE_H_
/*-----------------------------------------------------------------------------
	定数定義
-----------------------------------------------------------------------------*/
#define SCORE_DIGIT ( 6 )	//	何桁の数字の表示
/*-----------------------------------------------------------------------------
	構造体
-----------------------------------------------------------------------------*/
/*-----------------------------------------------------------------------------
	プロトタイプ宣言
-----------------------------------------------------------------------------*/
void InitScore( void );	//	スコアの初期化
void UninitScore( void );	//	スコアの終了
void UpdateScore( void );	//	スコアの更新
void DrawScore( void );	//	スコアの描画
int *GetScore(void);	//	スコアの情報
bool *GetScoreFlag( void );	//	スコアフラグの情報
#endif