/*=============================================================================

		タイム[ score.h ]

-------------------------------------------------------------------------------
	■　製作者
		大野拓也

	■　作成日
		2016/08/02
-------------------------------------------------------------------------------
	■　Update
		2016/08/02
			・プロトタイプ宣言追加
				void InitTime( void );	//	タイムの初期化
				void UninitTime( void );	//	タイムの終了
				void UpdateTime( void );	//	タイムの更新
				void DrawTime( void );	//	タイムの描画
-----------------------------------------------------------------------------*/
#ifndef _TIME_H_
#define _TIME_H_
/*-----------------------------------------------------------------------------
	プロトタイプ宣言
-----------------------------------------------------------------------------*/
void InitTime( void );	//	タイムの初期化
void UninitTime( void );	//	タイムの終了
void UpdateTime( void );	//	タイムの更新
void DrawTime( void );	//	タイムの描画
int *GetTime( void );	//	タイムの情報の取得
#endif