/*=============================================================================

		タイトル[ Title.h ]

-------------------------------------------------------------------------------
	■　製作者
		大野拓也

	■　作成日
		2016/08/02
-------------------------------------------------------------------------------
	■　Update
		2016/08/02
			・プロトタイプ宣言の追加
				void InitTitle( void );	//	タイトルの初期化
				void UninitTitle( void );	//	タイトルの終了
				void UpdateTitle( void );	//	タイトルの更新
				void DrawTitle( void );	//	タイトルの描画
*/
#ifndef _TITLE_H_
#define _TITLE_H_

#define DELAY_PAD ( 10 )	//	パッドのディレイ
/*-----------------------------------------------------------------------------
	構造体
-----------------------------------------------------------------------------*/
typedef struct
{
	D3DXVECTOR2 Pos;	//	座標
	D3DXVECTOR2 Size;	//	大きさ
	D3DXVECTOR2 move;	//	移動量
}TITLE;
/*-----------------------------------------------------------------------------
	プロトタイプ宣言
-----------------------------------------------------------------------------*/
void InitTitle( void );	//	タイトルの初期化
void UninitTitle( void );	//	タイトルの終了
void UpdateTitle( void );	//	タイトルの更新
void DrawTitle( void );	//	タイトルの描画
#endif