/*=============================================================================

		説明[ tutorial.h ]

-------------------------------------------------------------------------------
	■　製作者
		大野拓也

	■　作成日
		2016/09/01
-------------------------------------------------------------------------------
	■　Update
		2016/09/01
			・プロトタイプ宣言追加
				void InitTutorial(void);	//	チュートリアルの初期化
				void UninitTutorial(void);	//	チュートリアルの終了
				void UpdateTutorial(void);	//	チュートリアルの更新
				void DrawTutorial(void);	//	チュートリアルの描画
-----------------------------------------------------------------------------*/
#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_
/*-----------------------------------------------------------------------------
	定数定義
-----------------------------------------------------------------------------*/
#define MAX_TUTORIAL ( 5 )
/*-----------------------------------------------------------------------------
	構造体
-----------------------------------------------------------------------------*/
typedef struct
{
	D3DXVECTOR2 pos;	//	座標
	D3DXVECTOR2 size;	//	大きさ
	float Move_X;	//	移動量
}TUTORIAL;
/*-----------------------------------------------------------------------------
	プロトタイプ宣言
-----------------------------------------------------------------------------*/
void InitTutorial(void);	//	チュートリアルの初期化
void UninitTutorial(void);	//	チュートリアルの終了
void UpdateTutorial(void);	//	チュートリアルの更新
void DrawTutorial(void);	//	チュートリアルの描画
TUTORIAL *GetTutorial( void );	//	チュートリアル情報の取得
#endif